using System;
using System.Collections.Generic;

namespace Lesson9
{
    internal class Lesson9
    {
        public static void Main(string[] args)
        {
            //В этом уроке не будет много писанины.
            //Для начала нужно ознакомиться с многомерными массивами по ссылке
            //https://professorweb.ru/my/csharp/charp_theory/level4/4_2.php
            
            //Ну а теперь задание.
            //Нужно написать полноценную консольную программу
            //Которая позволяет пользователю ввести квадратичную матрицу
            //А на выходе пишет элемнты этой матрицы и сумму диагональных элементов
            //Учесть несколько факторов:
            //1. Пользователь может вводить только числа
            //2. Пользователь может вводить любые числа
            //3. Программа должна корректно обрабатывать все исключительные ситуации
            
        }
    }
}